# 1. В диапазоне натуральных чисел от 2 до 99 определить, сколько из них кратны каждому из чисел в диапазоне от 2 до 9.
a = b = c = d = e = f = g = h = 0
for i in range(2, 100):
    if i % 2 == 0:
        a += 1
    if i % 3 == 0:
        b += 1
    if i % 4 == 0:
        c += 1
    if i % 5 == 0:
        d += 1
    if i % 6 == 0:
        e += 1
    if i % 7 == 0:
        f += 1
    if i % 8 == 0:
        g += 1
    if i % 9 == 0:
        h += 1
print(f'В диапазоне от 2 до 99\n'
      f'числу "2" кратны {a} чисел,\n'
      f'числу "3" кратны {b} числа,\n'
      f'числу "4" кратны {c} числа,\n'
      f'числу "5" кратны {d} чисел,\n'
      f'числу "6" кратны {e} чисел,\n'
      f'числу "7" кратны {f} чисел,\n'
      f'числу "8" кратны {g} чисел,\n'
      f'числу "9" кратны {h} чисел.\n')
